---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelWallBaseProjection
source: html/18fa64a5-aac3-ff28-57ba-ed8c29acb5a5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelWallBaseProjection Property

"Base y Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelWallBaseProjection { get; }
```